Projects/Webservices/getallaccountsextended/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="https://sintguido.smartschool.be/Webservices/V3" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:getAllAccountsExtended><accesscode xsi:type="xsd:string">b68c0145c090e8259b47</accesscode><code xsi:type="xsd:string">1AA</code><recursive xsi:type="xsd:string">0</recursive></ns1:getAllAccountsExtended></SOAP-ENV:Body></SOAP-ENV:Envelope>
